I'm actually having the same issue. I can reproduce it using the following steps:

1. Create a new AI Platform notebook with the following Terraform config:

```
resource "google_notebooks_instance" "trainer-notebook-cu101-2" {
  name = "trainer-notebook-cu101-2"
  location = var.zone
  machine_type = "n1-standard-8"

  install_gpu_driver = true
  accelerator_config {
    type         = "NVIDIA_TESLA_P100"
    core_count   = 1
  }

  vm_image {
    project      = "deeplearning-platform-release"
    image_family = "common-cu101-notebooks-debian-9"
  }

  boot_disk_type = "PD_SSD"
  boot_disk_size_gb = 100

  data_disk_type = "PD_SSD"
  data_disk_size_gb = 100

  no_public_ip = true

  network = data.google_compute_network.network.id
  subnet = data.google_compute_subnetwork.subnetwork.id

  depends_on = [google_project_service.notebook]
}
```

2. Run `terraform apply --var-file environment/project.tfvars`.
3. Wait for the instance to be created. 
4. Once it is created, run  `terraform apply --var-file environment/project.tfvars` again. You will now see the following output:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_notebooks_instance.trainer-notebook-cu101-2 must be replaced
-/+ resource "google_notebooks_instance" "trainer-notebook-cu101-2" {
        boot_disk_size_gb      = 100
        boot_disk_type         = "PD_SSD"
      ~ create_time            = "2021-07-05T07:20:58.003814147Z" -> (known after apply)
        data_disk_size_gb      = 100
      + data_disk_type         = "PD_SSD" # forces replacement
      ~ id                     = "projects/[hidden]/locations/europe-west1-d/instances/trainer-notebook-cu101-2" -> (known after apply)
        install_gpu_driver     = true
      - labels                 = {
          - "goog-caip-notebook" = ""
        } -> null
        location               = "europe-west1-d"
        machine_type           = "n1-standard-8"
        name                   = "trainer-notebook-cu101-2"
      ~ network                = "https://www.googleapis.com/compute/v1/projects/[hidden]/global/networks/main-network" -> "projects/[hidden]/global/networks/main-network"
      - no_proxy_access        = false -> null
        no_public_ip           = true
      ~ project                = "[hidden]" -> (known after apply)
      ~ proxy_uri              = "[hidden]" -> (known after apply)
      ~ service_account        = "[hidden]" -> (known after apply)
      - service_account_scopes = [] -> null
      ~ state                  = "ACTIVE" -> (known after apply)
      ~ subnet                 = "https://www.googleapis.com/compute/v1/projects/[hidden]/regions/europe-west1/subnetworks/europe-west1" -> "projects/[hidden]/regions/europe-west1/subnetworks/europe-west1"
      - tags                   = [] -> null
      ~ update_time            = "2021-07-05T07:23:42.527571088Z" -> (known after apply)

        accelerator_config {
            core_count = 1
            type       = "NVIDIA_TESLA_P100"
        }

      ~ shielded_instance_config {
          ~ enable_integrity_monitoring = true -> (known after apply)
          ~ enable_secure_boot          = false -> (known after apply)
          ~ enable_vtpm                 = true -> (known after apply)
        }

      ~ vm_image {
            image_family = "common-cu101-notebooks-debian-9"
            project      = "deeplearning-platform-release"
        }
    }

Plan: 1 to add, 1 to destroy.
```
(I have `[hidden]` some sensitive content.)

Note the `# forces replacement` here next to the `data_disk_type`. This doesn't make sense, as this notebook was just created and I didn't change anything in the meantime to it.

When I remove the `data_disk_type = "PD_SSD"` from the Terraform config, it doesn't try to destroy the notebook anymore.

---

Version Info:
```
Terraform v0.13.7
+ provider registry.terraform.io/hashicorp/google v3.62.0
```